Repository: RickyTan5350/kalmnest
Catalog: flutter_codelab/lib/l10n/app_*.arb
Languages: ms

source: Hello World
ms: Halo Dunia

# userProfile
source: Profile
ms: Profil

source: Log out
ms: Log keluar

source: Select Language
ms: Pilih Bahasa

# helloUser
source: Hello, {userName}
ms: Halo, {userName}

# logoutConfirmation
source: Log out of your account?
ms: Log keluar dari akaun anda?

source: Cancel
ms: Batal

# loginFailed
source: Login Failed: {error}
ms: Log Masuk Gagal: {error}

source: Autofill success!
ms: Isian automatik berjaya!

# emailHint
source: user@example.com
ms: user@contoh.com

# emailValidation
source: Please enter a valid email address
ms: Sila masukkan alamat e-mel yang sah

# passwordValidation
source: Password must be at least 6 characters
ms: Kata laluan mestilah sekurang-kurangnya 6 aksara

source: Email
ms: E-mel

source: Valid email required
ms: E-mel yang sah diperlukan

source: Password
ms: Kata Laluan

source: Password required
ms: Kata laluan diperlukan

source: Log In
ms: Log Masuk

source: Forgot Password?
ms: Lupa Kata Laluan?

source: Account Recovery
ms: Pemulihan Akaun

# resetCodeSent
source: Reset code sent! Check your email.
ms: Kod tetapan semula dihantar! Semak e-mel anda.

# enterEmailInstructions
source: Enter your email address to receive a 6-digit verification code.
ms: Masukkan alamat e-mel anda untuk menerima kod pengesahan 6 digit.

source: Send Reset Code
ms: Hantar Kod Tetapan Semula

source: Quiz
ms: Kuiz

# passwordResetSuccess
source: Password reset successfully! Please login.
ms: Kata laluan berjaya ditetapkan semula! Sila log masuk.

source: Set New Password
ms: Tetapkan Kata Laluan Baru

# sixDigitCode
source: 6-Digit Code
ms: Kod 6 Digit

source: New Password
ms: Kata Laluan Baru

source: Passwords do not match
ms: Kata laluan tidak sepadan

source: Confirm Password
ms: Sahkan Kata Laluan

source: Reset Password
ms: Tetapkan Semula Kata Laluan

source: Name
ms: Nama

source: Date
ms: Tarikh

source: Unlocked
ms: Dibuka

source: Locked
ms: Dikunci

source: Ascending
ms: Menaik

source: Descending
ms: Menurun

source: No levels found
ms: Tiada tahap dijumpai

source: Delete
ms: Padam

# forUser
source: for {email}
ms: untuk {email}

source: Achievements
ms: Pencapaian

# searchHint
source: Search titles or descriptions...
ms: Cari tajuk atau penerangan...

source: All
ms: Semua

source: Created by Me
ms: Dicipta oleh Saya

source: Sort By
ms: Susun Mengikut

source: Order
ms: Turutan

source: Refresh List
ms: Segarkan Senarai

source: Sort Options
ms: Pilihan Susunan

source: Game Levels
ms: Tahap Permainan

source: Refresh Levels
ms: Segarkan Tahap

source: Add Level
ms: Tambah Tahap

source: Search levels...
ms: Cari tahap...

source: Visibility
ms: Kebolehlihatan

source: Public
ms: Awam

source: Private
ms: Peribadi

source: Delete Level
ms: Padam Tahap

# deleteLevelConfirmation
source: Are you sure you want to delete this level?
ms: Adakah anda pasti mahu memadamkan tahap ini?

# failedToLoadLevel
source: Failed to load level data
ms: Gagal memuatkan data tahap

source: Notes
ms: Nota

# searchNotesHint
source: Search topic or title
ms: Cari topik atau tajuk

source: Users
ms: Pengguna

source: Games
ms: Permainan

source: Classes
ms: Kelas

source: AI Chat
ms: Sembang AI

source: Feedback
ms: Maklum Balas

# searchUserHint
source: Search users...
ms: Cari pengguna...

source: Importing users...
ms: Mengimport pengguna...

# usersImportedSuccess
source: Users imported successfully!
ms: Pengguna berjaya diimport!

# importFailed
source: Import Failed: {error}
ms: Import Gagal: {error}

source: Student
ms: Pelajar

source: Teacher
ms: Guru

source: All Status
ms: Semua Status

source: Active
ms: Aktif

source: Inactive
ms: Tidak Aktif

source: My Feedback
ms: Maklum Balas Saya

# failedToLoadFeedback
source: Failed to load feedback: {error}
ms: Gagal memuatkan maklum balas: {error}

source: Error loading feedback
ms: Ralat memuatkan maklum balas

source: Retry
ms: Cuba Lagi

source: No feedback yet
ms: Tiada maklum balas lagi

# teachersFeedbackInstructions
source: Your teachers will provide feedback here
ms: Guru anda akan memberikan maklum balas di sini

# fromTeacher
source: From: {teacherName}
ms: Daripada: {teacherName}

# classCreatedSuccess
source: Class created successfully!
ms: Kelas berjaya dicipta!

# noPermissionCreateUser
source: You do not have permission to create user accounts.
ms: Anda tidak mempunyai kebenaran untuk mencipta akaun pengguna.

source: Select Action
ms: Pilih Tindakan

source: Create User Profile
ms: Cipta Profil Pengguna

source: Import User Profile
ms: Import Profil Pengguna

# studentsCannotCreateGames
source: Students cannot create games. This is for Teachers and Admins only.
ms: Pelajar tidak boleh mencipta permainan. Ini hanya untuk Guru dan Admin sahaja.

# studentsCannotAddNotes
source: Students cannot add notes. This is for Admins only.
ms: Pelajar tidak boleh menambah nota. Ini hanya untuk Admin sahaja.

# noAccessFunction
source: You do not have access to this function
ms: Anda tidak mempunyai akses kepada fungsi ini

# noAccessCreateFeedback
source: You do not have access to create feedback
ms: Anda tidak mempunyai akses untuk mencipta maklum balas

# userAchievements
source: {name}'s Achievements
ms: Pencapaian {name}

source: Create New User
ms: Cipta Pengguna Baru

# pleaseConfirmPassword
source: Please confirm your password
ms: Sila sahkan kata laluan anda

# userAccountCreatedSuccess
source: User account successfully created!
ms: Akaun pengguna berjaya dicipta!

# networkErrorCheckApi
source: Network Error: Check API URL and server status.
ms: Ralat Rangkaian: Semak URL API dan status pelayan.

# unknownErrorOccurred
source: An unknown error occurred: {error}
ms: Ralat tidak diketahui berlaku: {error}

source: Create User
ms: Cipta Pengguna

source: Delete Users
ms: Padam Pengguna

# deleteUsersConfirmation
source: Are you sure you want to delete {count} users? This action cannot be undone.
ms: Adakah anda pasti mahu memadamkan {count} pengguna? Tindakan ini tidak boleh dibatalkan.

# deletingUsers
source: Deleting selected users...
ms: Memadamkan pengguna yang dipilih...

# deletedUsersSuccess
source: Successfully deleted {count} users
ms: Berjaya memadamkan {count} pengguna

# errorDeletingUsers
source: Error deleting users: {error}
ms: Ralat memadamkan pengguna: {error}

# errorLoadingAchievements
source: Error loading achievements: {error}
ms: Ralat memuatkan pencapaian: {error}

# selectedCount
source: {count} Selected
ms: {count} Dipilih

source: Delete Selected Users
ms: Padam Pengguna yang Dipilih

# resultsCount
source: {count} Results
ms: {count} Keputusan

source: No users found
ms: Tiada pengguna dijumpai

source: Delete User Account?
ms: Padam Akaun Pengguna?

# deleteUserAccountConfirmation
source: Are you sure you want to permanently delete {name}'s account and all associated data? This action cannot be undone.
ms: Adakah anda pasti mahu memadamkan akaun {name} dan semua data berkaitan secara kekal? Tindakan ini tidak boleh dibatalkan.

# deletedUserSuccess
source: Successfully deleted user: {name}
ms: Berjaya memadamkan pengguna: {name}

# accessDeniedAdminOnly
source: Access Denied: Only Administrators can delete user accounts.
ms: Akses Dinafikan: Hanya Administrator yang boleh memadamkan akaun pengguna.

# errorDeletingUser
source: Error deleting user: {error}
ms: Ralat memadamkan pengguna: {error}

source: Edit User Profile
ms: Edit Profil Pengguna

source: Error loading profile
ms: Ralat memuatkan profil

source: User Profile Details
ms: Butiran Profil Pengguna

source: Phone
ms: Telefon

source: Address
ms: Alamat

# genderLabel
source: Gender
ms: Jantina

# joinedDateLabel
source: Joined Date
ms: Tarikh Menyertai

# accountStatusLabel
source: Account Status
ms: Status Akaun

source: Recent Achievements
ms: Pencapaian Terkini

source: View All
ms: Lihat Semua

# noAchievementsYet
source: No achievements unlocked yet.
ms: Tiada pencapaian dibuka lagi.

source: Unknown Date
ms: Tarikh Tidak Diketahui

source: Achievement
ms: Pencapaian

# unlockedOn
source: Unlocked on {date}
ms: Dibuka pada {date}

source: Save Changes
ms: Simpan Perubahan

source: Confirm New Password
ms: Sahkan Kata Laluan Baru

# passwordsMatchError
source: Error: New password and confirmation must match.
ms: Ralat: Kata laluan baru dan pengesahan mestilah sama.

# userProfileUpdated
source: User profile successfully updated!
ms: Profil pengguna berjaya dikemas kini!

# accessDeniedAdminModify
source: Access Denied: Only Administrators can modify user profiles.
ms: Akses Dinafikan: Hanya Administrator yang boleh mengubah profil pengguna.

# errorUpdatingProfile
source: Error updating profile: {error}
ms: Ralat mengemas kini profil: {error}

# pleaseEnterName
source: Please enter a name
ms: Sila masukkan nama

# pleaseEnterEmail
source: Please enter an email
ms: Sila masukkan e-mel

# enterValidEmail
source: Enter a valid email address
ms: Masukkan alamat e-mel yang sah

# passwordLengthError
source: Password must be at least 8 characters
ms: Kata laluan mestilah sekurang-kurangnya 8 aksara

# confirmPasswordRequired
source: Please confirm the new password
ms: Sila sahkan kata laluan baru

# pleaseEnterPhone
source: Please enter a phone number
ms: Sila masukkan nombor telefon

# enterValidPhone
source: Enter a valid Malaysian phone number
ms: Masukkan nombor telefon Malaysia yang sah

# pleaseEnterAddress
source: Please enter an address
ms: Sila masukkan alamat

# pleaseSelectGender
source: Please select a gender
ms: Sila pilih jantina

# pleaseSelectRole
source: Please select a role
ms: Sila pilih peranan

# roleLabel
source: Role
ms: Peranan

source: Male
ms: Lelaki

source: Female
ms: Perempuan

source: Other
ms: Lain-lain

source: Feedbacks
ms: Maklum Balas

source: Results
ms: Keputusan

source: No feedback found.
ms: Tiada maklum balas dijumpai.

source: Sort by Time
ms: Susun Mengikut Masa

source: Newest First
ms: Terkini Dahulu

source: Oldest First
ms: Terlama Dahulu

source: Refresh Feedbacks
ms: Segarkan Maklum Balas

source: Filter by Student
ms: Tapis Mengikut Pelajar

source: All Students
ms: Semua Pelajar

source: Filter by Teacher
ms: Tapis Mengikut Guru

source: All Teachers
ms: Semua Guru

# deleteFeedbackTitle
source: Delete Feedback?
ms: Padam Maklum Balas?

# deleteFeedbackConfirmation
source: Are you sure you want to delete this feedback? This action cannot be undone.
ms: Adakah anda pasti mahu memadamkan maklum balas ini? Tindakan ini tidak boleh dibatalkan.

source: Feedback deleted
ms: Maklum balas dipadam

source: Edit Feedback
ms: Edit Maklum Balas

source: Current Topic
ms: Topik Semasa

# discardChangesTitle
source: Discard Changes?
ms: Abaikan Perubahan?

# discardChangesConfirmation
source: You have unsaved changes. Are you sure you want to discard them?
ms: Anda mempunyai perubahan yang belum disimpan. Adakah anda pasti mahu mengabaikannya?

source: Discard
ms: Abaikan

# changesSavedSuccess
source: Changes saved successfully!
ms: Perubahan berjaya disimpan!

# updateFailed
source: Update failed: {error}
ms: Kemas kini gagal: {error}

# from
source: From: {name}
ms: Daripada: {name}

# failedToLoadStudents
source: Failed to load students: {error}
ms: Gagal memuatkan pelajar: {error}

# pleaseSelectStudent
source: Please select a student
ms: Sila pilih pelajar

# feedbackSentTo
source: Feedback sent to {name}
ms: Maklum balas dihantar kepada {name}

# accessDeniedCreateFeedback
source: Access Denied: Only teachers can create feedback.
ms: Akses Ditolak: Hanya guru boleh membuat maklum balas.

source: New Feedback
ms: Maklum Balas Baru

source: Select Student
ms: Pilih Pelajar

source: Select a student
ms: Pilih seorang pelajar

source: No students available
ms: Tiada pelajar tersedia

source: Select Topic
ms: Pilih Topik

source: Select a topic
ms: Pilih satu topik

# pleaseSelectTopic
source: Please select a topic
ms: Sila pilih topik

source: Title
ms: Tajuk

# titleHint
source: e.g., Great Job!
ms: cth., Kerja Bagus!

# pleaseEnterTitle
source: Please enter a title
ms: Sila masukkan tajuk

# feedbackHint
source: Write your feedback here...
ms: Tulis maklum balas anda di sini...

source: Please write feedback
ms: Sila tulis maklum balas

source: Send
ms: Hantar

# errorLoadingHistory
source: Error loading history: {error}
ms: Ralat memuatkan sejarah: {error}

# errorLoadingMessages
source: Error loading messages: {error}
ms: Ralat memuatkan mesej: {error}

source: Clear History
ms: Kosongkan Sejarah

# clearHistoryConfirmation
source: Are you sure you want to delete this chat session?
ms: Adakah anda pasti mahu memadamkan sesi sembang ini?

source: Chat deleted successfully
ms: Sembang berjaya dipadam

source: Chat cleared successfully
ms: Sembang berjaya dikosongkan

# deleteFailed
source: Delete failed: {error}
ms: Gagal memadam: {error}

# howCanIHelp
source: How can I help you today?
ms: Bagaimana saya boleh membantu anda hari ini?

source: Ask Question
ms: Tanya Soalan

source: Recent Questions
ms: Soalan Terkini

# noQuestionsFound
source: No previous questions found.
ms: Tiada soalan terdahulu ditemui.

source: Untitled Question
ms: Soalan Tanpa Tajuk

# quickSuggestions
source: Quick Learning Suggestions
ms: Cadangan Pembelajaran Pantas

# suggestionPrefix
source: Give me Learning Suggestion for
ms: Berikan Cadangan Pembelajaran untuk

# typeQuestionHint
source: Type your question...
ms: Taip soalan anda...

source: Back to History
ms: Kembali ke Sejarah

source: Refresh Question
ms: Segarkan Soalan

source: Delete Chat
ms: Padam Sembang

source: Class created successfully!
ms: Kelas berjaya dicipta!

source: Failed to create class
ms: Gagal mencipta kelas

source: Create New Class
ms: Cipta Kelas Baru

source: * indicates required fields
ms: * menunjukkan medan wajib

source: Class Name
ms: Nama Kelas

source: Enter class name
ms: Masukkan nama kelas

source: Description
ms: Penerangan

# enterDescription
source: Enter description (at least 10 words)
ms: Masukkan penerangan (sekurang-kurangnya 10 perkataan)

source: At least 10 words
ms: Sekurang-kurangnya 10 perkataan

source: Focus (Optional)
ms: Fokus (Pilihan)

source: None (Optional)
ms: Tiada (Pilihan)

source: Assign Teacher (Optional)
ms: Tugaskan Guru (Pilihan)

source: Class updated successfully!
ms: Kelas berjaya dikemas kini!

source: Failed to update class
ms: Gagal mengemas kini kelas

source: Edit Class
ms: Edit Kelas

source: Edit Class Details
ms: Edit Butiran Kelas

source: Loading...
ms: Memuatkan...

source: Select Teacher
ms: Pilih Guru

# classNameRequired
source: Class name is required
ms: Nama kelas diperlukan

# classNameMinCharacters
source: Class name must be at least 3 characters
ms: Nama kelas mestilah sekurang-kurangnya 3 aksara

# classNameMaxCharacters
source: Class name cannot exceed 100 characters
ms: Nama kelas tidak boleh melebihi 100 aksara

# descriptionRequired
source: Description is required
ms: Penerangan diperlukan

# descriptionMaxCharacters
source: Description cannot exceed 500 characters
ms: Penerangan tidak boleh melebihi 500 aksara

# descriptionMinWords
source: Description must contain at least 10 words
ms: Penerangan mesti mengandungi sekurang-kurangnya 10 perkataan

source: this class
ms: kelas ini

# deleteClassConfirmation
source: Are you sure you want to delete {className}? This action cannot be undone.
ms: Adakah anda pasti mahu memadamkan {className}? Tindakan ini tidak boleh dibatalkan.

source: Class deleted successfully!
ms: Kelas berjaya dipadam!

# errorDeletingClass
source: Error deleting class: {error}
ms: Ralat memadamkan kelas: {error}

source: Unknown
ms: Tidak Diketahui

source: N/A
ms: T/A

source: Details
ms: Butiran

source: Refresh
ms: Segarkan

source: Delete Class
ms: Padam Kelas

source: No Name
ms: Tiada Nama

source: No Teacher Assigned
ms: Tiada Guru Ditugaskan

# generalInfo
source: General Information
ms: Maklumat Am

source: Search Students
ms: Cari Pelajar

source: Total Students
ms: Jumlah Pelajar

source: Completion Rate
ms: Kadar Penyiapan

source: Quizzes Assigned
ms: Kuiz Ditugaskan

source: More Options
ms: Lebih Banyak Pilihan

source: View Details
ms: Lihat Butiran

source: Completed
ms: Selesai

source: Quizzes
ms: Kuiz

source: Course Progress
ms: Kemajuan Kursus

source: No students found
ms: Tiada pelajar dijumpai

# tryAdjustingSearchCriteria
source: Try adjusting your search criteria
ms: Cuba laraskan kriteria carian anda

source: No classes found
ms: Tiada kelas dijumpai

# tryAdjustingSearchQuery
source: Try adjusting your search query
ms: Cuba laraskan pertanyaan carian anda

# notEnrolledInAnyClasses
source: You are not enrolled in any classes
ms: Anda tidak mendaftar dalam mana-mana kelas

source: Class focus updated successfully!
ms: Fokus kelas berjaya dikemas kini!

source: Failed to update class focus
ms: Gagal mengemas kini fokus kelas

source: Edit Class Focus
ms: Edit Fokus Kelas

# editFocusFor
source: Edit Focus for {className}
ms: Edit Fokus untuk {className}

# youCanOnlyEditFocus
source: You can only edit the focus for your own classes
ms: Anda hanya boleh mengedit fokus untuk kelas anda sendiri

source: Failed to load quiz student data
ms: Gagal memuatkan data pelajar kuiz

source: Never
ms: Tidak Pernah

source: All Quizzes
ms: Semua Kuiz

source: Statistics
ms: Statistik

source: Pending
ms: Menunggu

source: Failed to load student quiz data
ms: Gagal memuatkan data kuiz pelajar

source: Gender
ms: Jantina

source: Joined Date
ms: Tarikh Menyertai

source: Account Status
ms: Status Akaun

source: Total Quizzes
ms: Jumlah Kuiz

source: No quizzes found
ms: Tiada kuiz dijumpai

source: Quiz Visibility
ms: Kebolehlihatan Kuiz

# howShouldQuizBeVisible
source: How should this quiz be visible?
ms: Bagaimanakah kuiz ini harus kelihatan?

source: Only visible to this class
ms: Hanya kelihatan kepada kelas ini

source: Visible to everyone
ms: Kelihatan kepada semua orang

source: Quiz created and assigned successfully!
ms: Kuiz berjaya dicipta dan ditugaskan!

source: Failed to assign quiz
ms: Gagal menugaskan kuiz

source: Quiz assigned successfully!
ms: Kuiz berjaya ditugaskan!

source: Remove Quiz
ms: Buang Kuiz

# areYouSureRemoveQuiz
source: Are you sure you want to remove this quiz from the class?
ms: Adakah anda pasti mahu membuang kuiz ini dari kelas?

source: Remove
ms: Buang

source: Quiz removed successfully!
ms: Kuiz berjaya dibuang!

# quizzesAvailable
source: {count} quizzes available
ms: {count} kuiz tersedia

source: View All Quizzes
ms: Lihat Semua Kuiz

source: No quizzes yet
ms: Tiada kuiz lagi

# createOrAssignQuizzes
source: Create or assign quizzes to get started
ms: Cipta atau tugaskan kuiz untuk bermula

# uploaded
source: Uploaded {date}
ms: Dimuat naik {date}

# viewAllXQuizzes
source: View All {count} Quizzes
ms: Lihat Semua {count} Kuiz

source: Unknown Teacher
ms: Guru Tidak Diketahui

source: No Teacher
ms: Tiada Guru

# studentSingular
source: student
ms: pelajar

# studentsPlural
source: students
ms: pelajar

source: No students
ms: Tiada pelajar

source: Assigned Teacher
ms: Guru Ditugaskan

source: Play
ms: Main

source: All Classes
ms: Semua Kelas

source: My Classes
ms: Kelas Saya

source: Enrolled Classes
ms: Kelas yang Didaftarkan

source: Search by class name
ms: Cari mengikut nama kelas

source: No description available
ms: Tiada penerangan tersedia

source: Timestamps
ms: Cap Masa

source: Created At
ms: Dicipta Pada

source: Updated At
ms: Dikemas Kini Pada

source: Assign Students (Optional)
ms: Tugaskan Pelajar (Pilihan)

source: Student {number}
ms: Pelajar {number}

source: Select Students
ms: Pilih Pelajar

source: Add Student
ms: Tambah Pelajar

source: Reset
ms: Tetapkan Semula

source: Create
ms: Cipta

source: Creator
ms: Pencipta

source: Focus
ms: Fokus

source: Not Set
ms: Tidak Ditentukan

source: Cannot open teacher profile
ms: Tidak boleh membuka profil guru

# noTeacherAssignedToClass
source: No teacher assigned to this class
ms: Tiada guru ditugaskan kepada kelas ini

source: Last Updated
ms: Kemas Kini Terakhir

source: Students
ms: Pelajar

# moreStudents
source: and {count} more students
ms: dan {count} pelajar lagi

source: No students enrolled
ms: Tiada pelajar mendaftar

source: List of Enrolled Students
ms: Senarai Pelajar yang Didaftarkan

source: Assigned
ms: Ditugaskan

source: Failed to remove quiz
ms: Gagal membuang kuiz

source: Search Quizzes
ms: Cari Kuiz

source: Assign Quiz
ms: Tugaskan Kuiz

source: Create Quiz
ms: Cipta Kuiz

source: Tap to view student completion
ms: Ketuk untuk melihat penyiapan pelajar

source: Assign Quiz to Class
ms: Tugaskan Kuiz kepada Kelas

source: Reload Quizzes
ms: Muat Semula Kuiz

source: No quizzes assigned
ms: Tiada kuiz ditugaskan

# pleaseEnterQuestion
source: Please enter a question
ms: Sila masukkan soalan

# aiLanguageNotice
source: AI responds in the same language as your question
ms: AI akan menjawab dalam bahasa yang sama dengan soalan anda
